wolgwang1729/seedsigner-esp32-bootloader/sdkconfig.defaults.esp32p4
CONFIG_IDF_TARGET="esp32p4"

# Custom partition table for ESP32-P4
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_esp32p4.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x20000

# ESP32-P4 specific chip revision (v1.3 board support)
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y

# PSRAM speed (P4 uses HEX SPI-PSRAM)
CONFIG_SPIRAM_SPEED_80M=y

# PMP & PVT configs
CONFIG_ESP_SYSTEM_PMP_IDRAM_SPLIT=n
CONFIG_ESP_ENABLE_PVT=n
